/**
 * @brief Systemクラス
 * 
 * @file system.c
 */

/************************************************************************************************/
/*	インクルードファイル記載																	*/
/************************************************************************************************/
#include <stdio.h>
#include <stdlib.h>
#include <time.h>
#include "common.h"
#include "system.h"

/************************************************************************************************/
/*	クラス内デバッグ設定																		*/
/************************************************************************************************/
#define M_ERROR(format, ...)		M_DEBUG_ERROR(D_DEBUG_CLASS_SYSTEM, format, ## __VA_ARGS__)
#define M_ENTRY(format, ...)		M_DEBUG_ENTRY(D_DEBUG_CLASS_SYSTEM, format, ## __VA_ARGS__)
#define M_INFO(format, ...)			M_DEBUG_INFO(D_DEBUG_CLASS_SYSTEM, format, ## __VA_ARGS__)

/************************************************************************************************/
/*	定義値																						*/
/************************************************************************************************/

/************************************************************************************************/
/*	クラス内参照メンバー変数																	*/
/************************************************************************************************/

/************************************************************************************************/
/*	内部関数プロトタイプ宣言																	*/
/************************************************************************************************/

/************************************************************************************************/
/*	外部公開関数																				*/
/************************************************************************************************/
/**
 * @brief	乱数生成初期化
 * @note	
 * @attention
 * system_random_init()呼び出し前に一度呼び出ししてください
 *
 */
void system_random_init(void)
{
	M_ENTRY();
	srand((unsigned)time(NULL));
}

/**
 * @brief	乱数生成
 * @note	int型の乱数を出力します
 * @attention
 * system_random_init()呼び出し後に呼び出してください
 *
 */
int system_random(void)
{
	M_ENTRY();
	int r = rand();
	return r;
}

/**
 * @brief	画面クリア
 * @note	OSごとに制御を分ける
 * @attention
 * 
 *
 */
void system_clear(void)
{
	system("clear");
}
